uploads/xml/Travelport-Request-668972ca07a1f-9177.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <univ:AirCreateReservationReq xmlns:air="http://www.travelport.com/schema/air_v51_0" xmlns:common_v51_0="http://www.travelport.com/schema/common_v51_0" xmlns:univ="http://www.travelport.com/schema/universal_v51_0" RetainReservation="Both" TargetBranch="P3763969" TraceId="ae84e5a33cf9f5319306fab5405cd081">
      <com:BillingPointOfSaleInfo xmlns:com="http://www.travelport.com/schema/common_v51_0" OriginApplication="UAPI"/>
      <com:BookingTraveler xmlns:com="http://www.travelport.com/schema/common_v51_0" Key="NTcwMDAwODQ2NGU2MWI2MGYzOTRjMS42OTg2NTkxOQ==" TravelerType="ADT" DOB="1973-08-29">
        <com:BookingTravelerName First="FADY" Last="FELALY"/>
        <com:PhoneNumber Number="+966548598445"/>
      </com:BookingTraveler>
      <com:FormOfPayment xmlns:com="http://www.travelport.com/schema/common_v51_0" Type="Cash"/>
      <air:AirPricingSolution Key="/k+AdB8CuDKAmjKHZcAAAA==" TotalPrice="SAR399.00" BasePrice="SAR173.00" ApproximateTotalPrice="SAR399.00" ApproximateBasePrice="SAR173.00" Taxes="SAR226.00" Fees="SAR0.00" ApproximateTaxes="SAR226.00" QuoteDate="2024-07-06">
        <air:AirSegment Key="/k+AdB8CuDKAkjKHZcAAAA==" Group="0" Carrier="RJ" FlightNumber="735" ProviderCode="1G" Origin="RUH" Destination="AMM" DepartureTime="2024-07-21T06:40:00.000+03:00" ArrivalTime="2024-07-21T09:10:00.000+03:00" FlightTime="150" TravelTime="150" Distance="801" ClassOfService="W" Equipment="321" ChangeOfPlane="false" OptionalServicesIndicator="false" AvailabilitySource="S" ParticipantLevel="Secure Sell" LinkAvailability="true" PolledAvailabilityOption="O and D cache or polled status used with different local status" AvailabilityDisplayType="Fare Specific Fare Quote Unbooked">
          <air:CodeshareInfo OperatingCarrier="RJ">ROYAL JORDANIAN</air:CodeshareInfo>
          <air:FlightDetails Key="/k+AdB8CuDKAljKHZcAAAA==" Origin="RUH" Destination="AMM" DepartureTime="2024-07-21T06:40:00.000+03:00" ArrivalTime="2024-07-21T09:10:00.000+03:00" FlightTime="150" TravelTime="150" Distance="801"/>
        </air:AirSegment>
        <air:AirPricingInfo Key="/k+AdB8CuDKAojKHZcAAAA==" TotalPrice="SAR399.00" BasePrice="SAR173.00" ApproximateTotalPrice="SAR399.00" ApproximateBasePrice="SAR173.00" ApproximateTaxes="SAR226.00" Taxes="SAR226.00" LatestTicketingTime="2024-07-10T23:59:00.000+03:00" PricingMethod="Manual" IncludesVAT="false" ETicketability="Yes" PlatingCarrier="RJ" ProviderCode="1G" TotalNetPrice="SAR399.00">
          <air:FareInfo Key="/k+AdB8CuDKAvjKHZcAAAA==" FareBasis="WBBSPSA1" PassengerTypeCode="ADT" Origin="RUH" Destination="AMM" EffectiveDate="2024-07-06T19:37:00.000+03:00" DepartureDate="2024-07-21" Amount="SAR173.00" PrivateFare="AirlinePrivateFare" NegotiatedFare="true" TourCode="PVRUHAMMXY0823" NotValidBefore="2024-07-21" NotValidAfter="2024-07-21" PseudoCityCode="36X1" TaxAmount="SAR226.00">
            <common_v51_0:Endorsement Value="NNEND/CHANGE RES FEE APPLY"/>
            <air:FareRuleKey FareInfoRef="/k+AdB8CuDKAvjKHZcAAAA==" ProviderCode="1G">6UUVoSldxwj36XCS3Ea+4MbKj3F8T9EyxsqPcXxP0TLGyo9xfE/RMjJs02vwFm2eLbI4+cPVKQoEqLp/SBmG5eFbFt3DvUGd9QyqotAVNswJtgoUJ8hHFfiwB0NqM9S2fMiDPbbRoRFFzHslRyor8HH6HXeGSfUaGHdai80UviP2/RT1MyaSakmAKChKcihQu1AKdw68vG6T6UaaTYyzR+hM3WsmhX/y9kY7J0WSfnzgu7qA4bqn+YfIYcQY4qGsQu0ZscBMSQ4Em5TOIOG+HxiX7zO75ENDiC3bcV+IT/huzkEjy9LP2MCIbRqMTJchO9AiVt4ZroBC/YIEuJEelp10CZUr2tRvd0M9KCV0d8JJTyB5x9tYSQLWhthMb3jlb5xUXFssNeuQXEngwOfYm+aoyaIUYH00ly5qxZ3qLwOXLmrFneovA5cuasWd6i8Dly5qxZ3qLwOXLmrFneovA2+QKPIWaRvq6oxE1UL944DjaSte7T4ddDlN7mTMg9Nh9gNl5H8YguS6jw/SweOTvDdktfI3c45W8aWAs8/FZag=</air:FareRuleKey>
            <air:Brand Key="/k+AdB8CuDKAvjKHZcAAAA==" BrandID="1434285" UpSellBrandID="1434284" Name="ECONOMY PLUS" Carrier="RJ" BrandTier="0003">
              <air:Title Type="External" LanguageCode="EN">Economy Plus</air:Title>
              <air:Title Type="Short" LanguageCode="EN">ECPLUS</air:Title>
              <air:Text Type="Strapline" LanguageCode="EN">Economy Plus</air:Text>
              <air:OptionalServices>
                <air:OptionalService Type="Baggage" CreateDate="2024-07-06T16:37:25.032+00:00" Key="/k+AdB8CuDKAxjKHZcAAAA==" SecondaryType="CY" Chargeable="Not offered" Tag="Carry On Hand Baggage" DisplayOrder="2">
                  <common_v51_0:ServiceData AirSegmentRef="/k+AdB8CuDKAkjKHZcAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>Carry On Hand Baggage</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                </air:OptionalService>
                <air:OptionalService Type="Branded Fares" CreateDate="2024-07-06T16:37:25.032+00:00" ServiceSubCode="P02" Key="/k+AdB8CuDKAyjKHZcAAAA==" Chargeable="Included in the brand" Tag="Other" DisplayOrder="999">
                  <common_v51_0:ServiceData AirSegmentRef="/k+AdB8CuDKAkjKHZcAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>CARRYON LUGGAGE 7 KGS</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                </air:OptionalService>
                <air:OptionalService Type="Branded Fares" CreateDate="2024-07-06T16:37:25.032+00:00" ServiceSubCode="P01" Key="/k+AdB8CuDKAzjKHZcAAAA==" Chargeable="Included in the brand" Tag="Other" DisplayOrder="999">
                  <common_v51_0:ServiceData AirSegmentRef="/k+AdB8CuDKAkjKHZcAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>CHECKED BAG ALLOWANCE</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                </air:OptionalService>
                <air:OptionalService Type="Branded Fares" CreateDate="2024-07-06T16:37:25.032+00:00" ServiceSubCode="057" Key="/k+AdB8CuDKA0jKHZcAAAA==" SecondaryType="FR" Chargeable="Included in the brand" Tag="Mileage Accrual" DisplayOrder="8">
                  <common_v51_0:ServiceData AirSegmentRef="/k+AdB8CuDKAkjKHZcAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>MILEAGE ACCRUAL</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                </air:OptionalService>
                <air:OptionalService Type="Branded Fares" CreateDate="2024-07-06T16:37:25.032+00:00" ServiceSubCode="059" Key="/k+AdB8CuDKA1jKHZcAAAA==" SecondaryType="VC" Chargeable="Available for a charge" Tag="Rebooking" DisplayOrder="3">
                  <common_v51_0:ServiceData AirSegmentRef="/k+AdB8CuDKAkjKHZcAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>CHANGEABLE TICKET</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                </air:OptionalService>
                <air:OptionalService Type="Branded Fares" CreateDate="2024-07-06T16:37:25.032+00:00" ServiceSubCode="06K" Key="/k+AdB8CuDKA2jKHZcAAAA==" SecondaryType="VR" Chargeable="Available for a charge" Tag="Refund" DisplayOrder="4">
                  <common_v51_0:ServiceData AirSegmentRef="/k+AdB8CuDKAkjKHZcAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>REFUND BEFORE DEPARTURE</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                </air:OptionalService>
                <air:OptionalService Type="Branded Fares" CreateDate="2024-07-06T16:37:25.032+00:00" ServiceSubCode="06L" Key="/k+AdB8CuDKA3jKHZcAAAA==" SecondaryType="VR" Chargeable="Not offered" Tag="Refund" DisplayOrder="4">
                  <common_v51_0:ServiceData AirSegmentRef="/k+AdB8CuDKAkjKHZcAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>REFUND AFTER DEPARTURE</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                </air:OptionalService>
                <air:OptionalService Type="PreReservedSeatAssignment" CreateDate="2024-07-06T16:37:25.032+00:00" ServiceSubCode="0B5" Key="/k+AdB8CuDKA4jKHZcAAAA==" Chargeable="Available for a charge" Tag="Seat Assignment" DisplayOrder="5">
                  <common_v51_0:ServiceData AirSegmentRef="/k+AdB8CuDKAkjKHZcAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>PRE RESERVED SEAT ASSIGNMENT</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                  <air:EMD AssociatedItem="Flight"/>
                </air:OptionalService>
                <air:OptionalService Type="MealOrBeverage" CreateDate="2024-07-06T16:37:25.032+00:00" Key="/k+AdB8CuDKA5jKHZcAAAA==" Chargeable="Not offered" Tag="Meals and Beverages" DisplayOrder="6">
                  <common_v51_0:ServiceData AirSegmentRef="/k+AdB8CuDKAkjKHZcAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>Meals and Beverages</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                </air:OptionalService>
                <air:OptionalService Type="InFlightEntertainment" CreateDate="2024-07-06T16:37:25.032+00:00" Key="/k+AdB8CuDKA6jKHZcAAAA==" SecondaryType="IT" Chargeable="Not offered" Tag="WiFi" DisplayOrder="7">
                  <common_v51_0:ServiceData AirSegmentRef="/k+AdB8CuDKAkjKHZcAAAA=="/>
                  <common_v51_0:ServiceInfo>
                    <common_v51_0:Description>WiFi</common_v51_0:Description>
                  </common_v51_0:ServiceInfo>
                </air:OptionalService>
              </air:OptionalServices>
            </air:Brand>
          </air:FareInfo>
          <air:BookingInfo BookingCode="W" CabinClass="Economy" FareInfoRef="/k+AdB8CuDKAvjKHZcAAAA==" SegmentRef="/k+AdB8CuDKAkjKHZcAAAA==" HostTokenRef="/k+AdB8CuDKAnjKHZcAAAA=="/>
          <air:TaxInfo Category="E3" Amount="SAR8.00" Key="/k+AdB8CuDKApjKHZcAAAA=="/>
          <air:TaxInfo Category="IO" Amount="SAR130.00" Key="/k+AdB8CuDKAqjKHZcAAAA=="/>
          <air:TaxInfo Category="T2" Amount="SAR5.00" Key="/k+AdB8CuDKArjKHZcAAAA=="/>
          <air:TaxInfo Category="O7" Amount="SAR10.00" Key="/k+AdB8CuDKAsjKHZcAAAA=="/>
          <air:TaxInfo Category="YQ" Amount="SAR22.00" Key="/k+AdB8CuDKAtjKHZcAAAA=="/>
          <air:TaxInfo Category="YR" Amount="SAR51.00" Key="/k+AdB8CuDKAujKHZcAAAA=="/>
          <air:FareCalc>RUH RJ AMM 46.13WBBSPSA1 NUC46.13END ROE3.75</air:FareCalc>
          <air:PassengerType Code="ADT" Age="51" BookingTravelerRef="NTcwMDAwODQ2NGU2MWI2MGYzOTRjMS42OTg2NTkxOQ=="/>
          <air:ChangePenalty PenaltyApplies="Anytime">
            <air:Amount>SAR130.00</air:Amount>
          </air:ChangePenalty>
          <air:CancelPenalty PenaltyApplies="After Departure">
            <air:Percentage>100.00</air:Percentage>
          </air:CancelPenalty>
          <air:BaggageAllowances>
            <air:BaggageAllowanceInfo TravelerType="ADT" Origin="RUH" Destination="AMM" Carrier="RJ">
              <air:URLInfo>
                <air:URL>VIEWTRIP.TRAVELPORT.COM/BAGGAGEPOLICY/RJ</air:URL>
              </air:URLInfo>
              <air:TextInfo>
                <air:Text>1P</air:Text>
                <air:Text>BAGGAGE DISCOUNTS MAY APPLY BASED ON FREQUENT FLYER STATUS/ ONLINE CHECKIN/FORM OF PAYMENT/MILITARY/ETC.</air:Text>
              </air:TextInfo>
              <air:BagDetails ApplicableBags="1stChecked" BasePrice="SAR0.00" ApproximateBasePrice="SAR0.00" TotalPrice="SAR0.00" ApproximateTotalPrice="SAR0.00">
                <air:BaggageRestriction>
                  <air:TextInfo>
                    <air:Text>UPTO66LB/30KG AND UPTO62LI/158LCM</air:Text>
                  </air:TextInfo>
                </air:BaggageRestriction>
              </air:BagDetails>
              <air:BagDetails ApplicableBags="2ndChecked" BasePrice="SAR226.00" ApproximateBasePrice="SAR226.00" TotalPrice="SAR226.00" ApproximateTotalPrice="SAR226.00">
                <air:BaggageRestriction>
                  <air:TextInfo>
                    <air:Text>EXCESS SIZE</air:Text>
                  </air:TextInfo>
                </air:BaggageRestriction>
              </air:BagDetails>
            </air:BaggageAllowanceInfo>
            <air:CarryOnAllowanceInfo Origin="RUH" Destination="AMM" Carrier="RJ">
              <air:TextInfo>
                <air:Text>1P</air:Text>
              </air:TextInfo>
              <air:CarryOnDetails ApplicableCarryOnBags="1" BasePrice="SAR0.00" ApproximateBasePrice="SAR0.00" TotalPrice="SAR0.00" ApproximateTotalPrice="SAR0.00">
                <air:BaggageRestriction>
                  <air:TextInfo>
                    <air:Text>UPTO15LB/7KG AND UPTO45LI/115LCM</air:Text>
                  </air:TextInfo>
                </air:BaggageRestriction>
              </air:CarryOnDetails>
            </air:CarryOnAllowanceInfo>
          </air:BaggageAllowances>
        </air:AirPricingInfo>
        <air:FareNote Key="/k+AdB8CuDKA8jKHZcAAAA==">TOUR CODE: PVRUHAMMXY0823</air:FareNote>
        <air:FareNote Key="/k+AdB8CuDKA9jKHZcAAAA==">LAST DATE TO PURCHASE TICKET: 10JUL24</air:FareNote>
        <air:FareNote Key="/k+AdB8CuDKA+jKHZcAAAA==">TICKETING AGENCY 36X1</air:FareNote>
        <air:FareNote Key="/k+AdB8CuDKA/jKHZcAAAA==">DEFAULT PLATING CARRIER RJ</air:FareNote>
        <air:FareNote Key="/k+AdB8CuDKAAkKHZcAAAA==">FARE HAS A PLATING CARRIER RESTRICTION</air:FareNote>
        <air:FareNote Key="/k+AdB8CuDKABkKHZcAAAA==">E-TKT REQUIRED</air:FareNote>
        <air:FareNote Key="/k+AdB8CuDKACkKHZcAAAA==">TICKETING FEES MAY APPLY</air:FareNote>
        <common_v51_0:HostToken Key="/k+AdB8CuDKAnjKHZcAAAA==">GFB10101ADT00  01WBBSPSA1                              010001#GFB200010101NADTV3458PLUS0020000499C9#GFMCXAB458YPLUSSRJ ADTWBBSPSA1</common_v51_0:HostToken>
      </air:AirPricingSolution>
      <com:ActionStatus xmlns:com="http://www.travelport.com/schema/common_v51_0" ProviderCode="1G" Type="ACTIVE" PseudoCityCode="36X1"/>
    </univ:AirCreateReservationReq>
  </soapenv:Body>
</soapenv:Envelope>
